---
kind: method
id: M:Autodesk.Revit.UI.Macros.ApplicationEntryPoint.FinishInitializationEO
source: html/fae6c1ae-a22b-5d80-6b13-fdd08be4a920.htm
---
# Autodesk.Revit.UI.Macros.ApplicationEntryPoint.FinishInitializationEO Method

For Revit Macros internal use only.

## Syntax (C#)
```csharp
public void FinishInitializationEO()
```